{
    "Home": "الصفحة الرئيسية",
    "About us": "عن الشركة",
    "Protfolio": "سابقة الأعمال",
    "Services": "خدماتنا",
    "Blogs": "مدونة",
    "Contact us": "تواصل معانا",
    "Everything you need to build your company or services online": "كل ما تحتاجه لبناء شركتك او خدماتك أونلاين",
    "We provide": "نقدم خدمات",
    "We provide various web services and offers suitable for all individuals and companies with the latest technologies, the best quality and the fastest time": "نقدم خدمات ويب متنوعة وعروض مناسبة لجميع الأفراد و الشركات بأحدث التقنيات وأفضل جودة واسرع وقت",
    "Website design": "تصميم مواقع إلكترونية",
    "Websites design": "تصميم مواقع إلكترونية",
    "Wordpress websites": "تصميم مواقع ووردبريس",

    "Online store design": "تصميم متجر إلكتروني",
    "Mobile application programming": "برمجة تطبيقات الجوال",
    "Website hosting": "استضافة مواقع الانترنت",
    "WordPress programming and website design": "برمجة وتصميم مواقع ورردبريس",
    "Preparing websites for search engines": "تهيئة المواقع لمحركات البحث",
    "Portfolio": "سابقة أعمالنا",
    "portfolio": "معرض الأعمال",
    "Websites": "مواقع ويب",
    "Information technology": "تكنولجيا المعلومات",
    "The Junior engineer platform": "منصة المهندس الصغير",
    "Creativity of engineering consulting": "ابداع الاستشارات الهندسي",
    "Car maintenance website": "موقع صيانة السيارات",
    "Alpha Clinic website": "موقع الفا كلينك",
    "Tourist travel website": "موقع رحلات سياحية ",
    "Our partners": "تعرف على شركاؤنا",
    "Our clients": "تعرف على عملائنا",
    "Our website design features": "مميزات تصميم موقعك الالكتروني لدينا",
    "Compatible with all devices": "متوافق مع جميع الأجهزة",
    "We always work to make the site compatible with smart devices and all mobile devices and screens such as browsing": "نعمل دائمًا على أن يكون الموقع متوافقًا مع الأجهزة الذكية وجميع أجهزة الجوال والشاشات مثل التصفح",
    "Official emails": "ايميلات رسمية",
    "We provide official emails under the domain name to all the company’s staff for easy communication between them and customers": "نوفر إيميلات رسمية بإسم الدومين إلى جميع طاقم الموظفين بالشركة لسهولة التواصل بينهم وبين العملاء",
    "Control your site easily": "تحكم فى موقعك بسهولة",
    "We offer an easy-to-use control panel. Manage your site's contents with ease at any time": "نحن نقدم لوحة تحكم سهلة الاستخدام. إدارة محتويات موقعك بسهولة في أي وقت",
    "multi languages": "تعدد اللغات",
    "We offer several language options for your site. It is possible for your site to be displayed in one language or displayed in more than one language, depending on your choice": "نقدم خيارات لغات عديدة لموقعك فمن الممكن أن يعرض موقعك بلغة واحدة أو يعرض بأكثر من لغة ويكون حسب إختيارك",
    "Professional slide show": "سلايد شو احترافى",
    "We provide you with a professional slide show to display all services and images in a distinctive way and control the slide from the control panel": "وفر لكم اسلايد شو إحترافى لعرض جميع الخدمات والصور بشكل مميز والتحكم فى الاسلايد من لوحة التحكم",
    "Search engine friendly site": "موقع صديق لمحركات البحث",
    "We add your site professionally to search engines to ensure that your site appears in the first search results on search engines": "نضيف موقعك بشكل إحترافى لمحركات البحث لتضمن لموقعك الظهور فى نتائج البحث الأولى على محركات البحث",
    "Fast design": "تصميم سريع",
    "We provide fast designs that are compatible with search engines so that your site appears quickly in search engines and all browsers": "نقدم تصميمات سريعة للتوافق مع محركات البحث لظهور موقعك فى محركات البحث بسرعة وجميع المتصفحات",
    "We are distinguished by simple, exclusive and professional designs with the intersection of different ideas that express you and your identity": "نتميز بتصميمات بسيطة وحصرية واحترافية مع تداخل الأفكار المختلفة التى تعبر عنك وعن هويتك",
    "IT Services": "خدمات تكنولوجيا المعلومات",
    "Cairo, Maadi Corniche St. Police Information Institute": "القاهرة ،كورنيش المعادى ش. معهد أمناء الشرطة",
    "Jeddah, King Fahd Road, Al Jazeera Building, Building 3": "جدة، طريق الملك فهد، مبنى الجزيرة، عمارة 3 ",
    "All rights reserved to © Core Technology Solutions": "كل الحقوق محفوظة لدى شركة © Core Technology Solutions",
    "We come to the forefront due to our accumulated experience in technical, software and business solutions and our provision of unprecedented solutions and unusual integration of communications systems, information networks and surveillance systems.": "نأتي في الصدارة لخبراتنا المتراكمة في الحلول التقنية والبرمجية وحلول الاعمال وتقديمنا لحلول غير مسبوقة ودمج غير إعتيادي لأنظمة الاتصالات وشبكات المعلومات ونظم المراقبة.",
    "We are a leading company in providing integrated services, specializing in providing web solutions services, programming, website hosting services, and designing commercial identities, in addition to design and implementation services for light current works and advanced security solutions.": "نحن شركة رائدة في تقديم خدمات متكاملة، متخصصة في تقديم خدمات حلول الويب والبرمجة وخدمات استضافة المواقع و تصميم الهويات التجارية بالاضافة الي خدمات تصميم وتنفيذ أعمال التيار الخفيف والحلول الأمنية المتطورة.",
    "Our mission": "مهمتنا",
    "Providing integrated solutions to its customers in the field of information technology with all its systems and fulfilling their requirements with accuracy and high efficiency, and finally designing websites and mobile applications that contribute and serve the community by creating a better environment to provide the best services and optimal employment of skills and creativity in developing solutions and building a local partnership. And a global leader.": "تقديم حلول متكاملة لعملائها فى مجال تكنولوجيا المعلومات بكافة أنظمتها و إنجاز متطلباتهم بدقة و كفاءة عالية و اخيرا تصميم مواقع الويب و تطبيقات الجوال تساهم و تخدم المجتمع من خلال إيجاد بيئة أفضل لتقديم أفضل الخدمات و التوظيف الأمثل للمهارات و الإبداع فى وضع الحلول و بناء شراكة محلية و عالمية رائدة .",
    "Our vision": "رؤيتنا",
    "To be a leading company in providing software applications and integrated technological solutions in eg, while leaving our mark throughout the Middle East region.": "أن نكون شركة رائدة في مجال توفير التطبيقات البرمجية والحلول التكنولوجية المتكاملة في مصر، مع ترك بصمتنا في جميع أنحاء منطقة الشرق الأوسط.",
    "Al Mannai Real Estate Development": "المناعى للتطوير العقارى",
    "Creativity for engineering consultancy": "إبداع للإستشارات الهندسية",
    "Junior engineer": "المهندس الصغير",
    "See our previous work from": "شاهد سابقة أعمالنا من",
    "Sites Design": "تصميم المواقع",
    "Kider to teach children": "Kider لتعليم الأطفال",
    "TourNest for trekking": "TourNest للرحلات ",
    "Prestige online store": "برستيج متجر الكترونى",
    "Source for construction products": "مصدر لمنتجات البناء",
    "Ramses Fresh": "رمسيس فريش",
    "Heliopolis Association": "جمعية مصر الجديدة",
    "summit": "summit",
    "Damas Steel": "داماس ستيل",
    "Your doctor": "طبيبك",
    "Thunder Sports Fashion": "ثاندر للأزياء الرياضية",
    "development": "تطوير",
    "Educational dash board": "داش بورد تعليمى",
    "Dwelling Real Estate": "Dwelling للعقارات",
    "Read": "إقرأ",
    "Please choose a service": "يرجى اختيار الخدمة",
    "Please enter a valid name": "من فضلك ادخل الاسم الصحيح",
    "Please enter your name": "من فضلك ادخل الاسم",
    "Please select a service": "من فضلك اختر خدمة",
    "Please enter a valid phone number": "من فضلك ادخل الرقم الصحيح",
    "Please enter your phone number": "من فضلك ادخل رقم الهاتف",
    "Please enter a valid email": "من فضلك ادخل الايميل الصحيح",
    "Please enter your email": "من فضلك ادخل الايميل",
    "Please enter your message": "من فضلك ادخل رسالتك",
    "Call us": "اتصل بنا",
    "Response will be made within 24 hours": "يتم الرد في وقت أقصاه 24 ساعة",
    "Choose the service": "اختر الخدمة",
    "Request a website design": "طلب تصميم موقع الكترونى",
    "Request a Landing Page design": "طلب تصميم Landing Page",
    "Request an online store design": "طلب تصميم متجر الكترونى",
    "WordPress website programming": "برمجة مواقع ووردبريس WordPress",
    "Design and installation of infrastructure for technology systems": "تصميم وتركيب البنية التحتية لأنظمة التكنولوجيا",
    "Name": "الأسم",
    "Phone": "الموبايل",
    "E-mail": "البريد الإلكتروني",
    "Your message": "رسالتك",
    "the service": "الخدمة",
    "send": "إرسال",
    "Failed to submit form. Please try again.": "لقد حدث خطأ، الرجاء أعد المحاولة.",
    "egypt": "مصر",
    "saudi": "السعودية",
    "Professional design": "تصميم احترافي",
    "Request a Company Website design": "طلب تصميم موقع شركة",
    "CTS | About Us": "CTS | عن الشركة",
    "CTS | Contact Us": "CTS | تواصل معنا",
    "CTS | Home": "CTS | الرئيسية",
    "CTS | Portfolio": "CTS | سابقة أعمالنا",
    "Thank you": "شكرا لك",
    "Your request has been sent, our team will contact you as soon as possible.": "تم إرسال طلبك، سيقوم فريقنا بالتواصل معك فى أسرع وقت ممكن. ",
    "(+20)1201117955": "1201117955(20+)",
    "(+966)542714543": "542714543(966+)",
    "Fast, professional website design compatible with all devices and search engines (SEO).": "تصميم موقع الكترونى احترافى سريع متوافق مع كافة الاجهزة و محركات البحث SEO",
    "The easiest way to display your services and products is to have a professionally designed website It combines form and efficiency, is compatible with all devices, and is fast in downloading, thus facilitating Search engines must archive it and appear when searching for any of your services or products.": "اسهل طريقة لعرض خدماتك ومنتاجاتك هى ان تمتلك موقع الكترونى ذا تصميم احترافى يجمع بين الشكل والكفاءة متوافق مع كافة الاجهزة وسريع فى التحميل وبالتالى يسهل على محركات البحث ارشفته وظهورة عند البحث علي اى خدمة من خدماتك او منتج من منتاجاتك.",
    "Offers": "العروض",
    "Free domain for one year.": "دومين مجاني لمدة سنة.",
    "Linking the website to social media platforms.": "ربط الموقع بمنصات التواصل الإجتماعي.",
    "Structural programming of the site at the highest level.": " برمجة هيكلية للموقع على أعلى مستوى.",
    "Secure product management system.": " نظام آمن تقدر من خلاله تضيف منتجاتك.",
    "Free technical support service for 6 months.": " خدمة دعم فنى مجانا لمدة 6 شهور.",
    "A comprehensive website management control panel.": " لوحة تحكم كاملة تقدر من خلالها تدير موقعك.",
    "The number of emails (e-mail) reaches 100 emails.": " عدد ايميلات ( البريد الألكترونى ) يصل الى 100 ايميل.",
    "The possibility of paying by credit cards through your website.": " امكانية الدفع عن طريق البطاقات الائتمانية من خلال موقعك الألكترونى.",
    "Design compatible with all devices (computer + tablet + mobile).": " تصميم متوافق مع جميع الأجهزة ( كمبيوتر + تابلت +موبايل  ).",
    "An attractive design that is appropriate to the character and field of the company and coordinated with the company logo.": "تصميم جذاب وملائم لطابع ومجال الشركة وتنسيقه مع شعار الشركة.",
    "Your site will be eligible to appear on search engines.": " موقعك هيكون مؤهل للظهور على محركات البحث.",
    "What makes your website special?": "ما الذي يجعل موقع الويب الخاص بك مميزًا؟",
    "speed": "السرعة",
    "design": "التصميم",
    "Safety": "الأمان",
    "Compatible with search engines": "متوافق مع محركات البحث",
    "cost": "التكلفة",
    "Ease of modification": "سهولة التعديل",
    "Easy control": "سهولة التحكم",
    "execution time": "وقت التنفيذ",
    "Web design": "تصميم المواقع",

    "Alpha Clinic for dental treatment": " لعلاج الاسنان Alpha Clinic",
    "Arcons Industrial Services": " للخدمات الصناعية Arcons",
    "Cleaned for cleaning services": " لخدمات النظافة Cleaned",
    "Ebdaa for engineering consultancy": "إبداع للاستشارات الهندسية",
    "Educap for courses": " للكورسات Educap",
    "Kider for educating kids": " لتعليم الأطفال Kider",
    "Little engineer": "المهندس الصغير",
    "Mannaie for real state": "المناعي للتطوير العقاري",
    "Masdar for building products": "مصدر لمنتجات البناء",
    "MotorMenders for cars": " للسيارات MotorMenders",
    "Prestige web store": "برستيج متجر الكترونى",
    "TourNest for travel": " للرحلات TourNest",
    "Pages from the site": "صفحات من الموقع",
    "View all works": "عرض جميع الأعمال",
    "Browse the site": "تصفح الموقع",
    "Request a quote": "طلب عرض سعر",
    "If you want a price quote for website design, contact us and we will contact you as soon as possible": "إذا كنت تريد عرض سعر لتصميم مواقع الكترونية،تواصل معنا وسنقوم بالاتصال بك في أسرع وقت",
    "Request your service now": "اطلب خدمتك الآن",
    "Mobile App": "تطبيقات الموبيل",
    "Easy to navigate": "سهولة التنقل",
    "By providing a navigation bar that links important pages in your application, making it easier for users to navigate the application and easily access what they want.": " بتوفير شريط تنقل يربط بين الصفحات المهمة في التطبيق الخاص بك، ويسهل على المستخدمين التنقل في التطبيق وسهولة الوصول إلى ما يريده.",
    "Usability": "قابلية الاستخدام",
    "We design your application with the appropriate specifications for the target customer. We study this customer first in order to improve the user experience and then apply the appropriate specifications for him.": "نقوم بتصميم التطبيق الخاص بك بالمواصفات المناسبة للعميل المستهدف، حيث نقوم بدراسة هذا العميل أولًا من أجل تحسين تجربة المستخدم ثم نقوم بتطبيق المواصفات المناسبة له.",
    "programming": "البرمجة",
    "The appropriate programming language is used, and programming is done according to the latest international standards, with further experiments being conducted on different types of mobile devices, in order to ensure their compatibility with all operating systems.": "يتم استخدام لغة البرمجة المناسبة، وتتم البرمجة وفقًا لأحدث المعايير العالمية، مع إجراء المزيد من التجارب على أنواع أجهزة المحمول المختلفة، من أجل التأكد من توافقها مع جميع أنظمة التشغيل.",
    "Publishing on app stores": "النشر على متاجر التطبيقات",
    "Once the application is finalized, its sections are complete, and all necessary operating tests are conducted, the application is released on application stores, such as Google Play and the App Store.": "بمجرد الإنتهاء من وضع اللمسات النهائية على التطبيق، والتأكد من اكتمال أقسامه، وإجراء كافة تجارب التشغيل اللازمة، يتم طرح التطبيق على متاجر التطبيقات، مثل جوجل بلاي وآب ستور.",
    "Modern and innovative design": "التصميم الحديث والمبتكر",
    "We have designers who specialize in creating the best designs that are compatible with the type of activity, whether service or commercial, so that it completely succeeds in achieving the purpose of its design and provides the best customer experience.": "لدينا مصممون متخصصون في ابتكار، أفضل التصميمات المتوافقة مع نوع النشاط إن كان خدمي أو تجاري بحيث ينجح تمامًا في تحقيق الغرض من تصميمه، ويقدم أفضل تجربة للعملاء.",
    "Continuous technical support": "الدعم الفني المستمر",
    "The company does not stop providing technical support to its customers, as it has a professional team trained to provide service around the clock.": "لا تتوقف الشركة عن تقديم الدعم الفني لعملائها، فلديها فريق محترف ومدرب على تقديم الخدمة على مدار الساعة.",
    "Search feature": "خاصية البحث",
    "Another feature that we provide is one of the most important factors that make the application successful, as it makes it easier for the customer to access what he wants easily. When the application is the easiest for the customer, he will repeat the purchase process.": "ميزة أخرى نقوم بتوفيرها، فهي من أهم العوامل التي تعمل على نجاح التطبيق، حيث تسهل على العميل الوصول إلى ما يريده بسهولة، فعندما يكون التطبيق أسهل ما يكون على العميل، سيقوم بتكرار عملية الشراء.",
    "Continuous Improvement": "التطوير المستمر",
    "All mobile applications designed by Core Technology Solutions are subject to continuous development and improvements to keep pace with the best global developments.": "تخضع جميع تطبيقات الجوال المصممة من شركة كور تكنولوجى إلى التطوير المستمر، وإدخال التحسينات عليها، لتظل مواكبة لأفضل التطورات العالمية.",
    "Evaluation system": "نظام التقييم",
    "We are working to provide a rating system feature so that users can evaluate your application across all application stores. They can also write a quick review based on their experience, and based on it, they will know what the customer needs and improve the user experience.": "نعمل على توفير ميزة نظام التقييم ليقوم المستخدمين بتقييم تطبيقك عبر جميع متاجر التطبيقات، كما يمكنهم كتابة مراجعة سريعة من خلال تجربتهم، وبناء عليها يتم معرفة ما يحتاجه العميل وتحسين تجربة المستخدم.",
    "Why customers prefer to get a mobile app from Core Technology Solutions": "لماذا يفضل العملاء الحصول على تطبيق جوال من كور تكنولوجى سوليوشنز",
    "Application design and programming": "تصميم و برمجة التطبيقات",
    "We have a work team with extensive experience in the field of designing mobile applications for both the Android or IOS operating systems that is able to help you transform your vision into a tangible reality that will be the beginning of amazing success.": "لدينا فريق عمل يمتلك خبرة كبيـرة في مجال تصميم تطبيقات الجوال لكل من نظامي التشغيل الأندرويد أو الـ IOS قادر على مساعدتـك على تحويل رؤيتك إلى واقـع ملموس يكون بداية لنجاح مبهر .",
    "Mobile applications": "تطبيقات الموبايل",
    "At Core Technology Solutions, we provide the service of designing and programming smart mobile applications for Android and iPhone for companies, individuals, and institutions with high quality and a control panel for each application according to need. We also create professional mobile applications for systems and companies, starting with the distinguished design appropriate to the idea and ending with strong programming and high performance, with attention to continuous updates to maintain success. The application after uploading it to Google Market or Father Story.": "نقدم فى كور تكنولوجي سوليوشنز خدمة تصميم وبرمجة تطبيقات الجوال الذكية اندرويد وايفون للشركات والأفراد والمؤسسات بجوده عاليه ولوحة تحكم لكل تطبيق حسب الاحتياج كما نقوم بعمل تطبيقات احترافية للجوال للأنظمه والشركات بدايه من التصميم المتميز المناسب للفكره وانتهاء ببرمجه قويه وأداء عالي مع الاهتمام بالتحديثات المستمره للحفاظ على نجاح التطبيق بعد رفعه على سوق جوجل أو الأب ستوري.",
    "Educational dashboard": "داشبورد تعليمي",
    "Zein real estate": "زين للتطوير العقاري",
    "Dwelling real estate": "دويلينج للتطوير العقاري",
    "Eqraa": "إقراً",
    "PIXI Travel": "بيكسي للرحلات",
    "Thndr sports wear": "ثندر للملابس الرياضية",
    "Tatweer": "تطوير",
    "Damas steel": "داماس ستيل",
    "BricoHub": "BricoHub",
    "Tabibac": "طبيبك",
    "Ramsees fresh": "رمسيس فريش",
    "Heliopolis association": "جمعية مصر الجديدة",
    "Summit": "Summit",
    "What distinguishes our e-commerce websites": "ما يميز مواقع المتاجر الالكترونية لدينا",
    "Mobile friendly": "متجاوب مع شاشات الموبايل",
    "Your store is responsive to all devices and supports all screen sizes, from mobile phones to computers": "متجرك متجاوب لجميع الاجهزة يدعم جميع احجام الشاشات من الهاتف المحمول الى اجهزة الكمبيوتر",
    "Distinctive hosting and domain": "استضافة مميزة و دومين",
    "The best fast hosting protected with the highest levels of security and protection on our servers, and also a domain of your choice that is easy and expressive of the store’s activity for a year for free, within the cost.": "افضل استضافة سريعة محمية على اعلى درجات الامان و الحماية على سيرفراتنا , وايضآ دومين من اختيارك سهل و معبر عن نشاط المتجر لمدة سنة مجانا ضمن التكلفة",
    "Different payment methods": "طرق دفع مختلفة",
    "Your store contains different payment methods to facilitate payment methods for the customer": "يحتوي متجرك علي طرق دفع مختلفة لتسهيل طرق الدفع على العميل",
    "Live chat": "لايف شات",
    "The Live Chat feature is added to your online store to facilitate the process of your customers reaching your sales team online and immediately and to facilitate communication processes.": "يتم اضافة خاصية لايف شات فى متجرك الالكترونى لتسهيل عمليات وصول عملاؤك الى فريق مبيعاتك اونلاين و فورا وتسهيل عمليات الاتصال",
    "Multilanguage": "امكانية تعدد اللغات",
    "We offer your online store to the whole world so that it can spread throughout it, by adding more than one language to your store to expand the circle of your customers interested in your activity in all parts of the world.": "نقدم متجرك الالكترونى للعالم كله كى ينتشر فيه وذلك عن طريق اضافة اكثر من لغة الى متجرك للتتسع دائرة عملائك المهتمين بنشاطك فى كل العالم",
    "shopping cart": "عربة التسوق",
    "The shopping cart is the most important addition to the online store, as online stores are similar to supermarkets": "عربة التسوق هي اهم اضافة للمتجر الالكتروني , حيث إن المتاجر الالكترونية تشبه السوبر ماركت",
    "Product comparison system": "نظام المقارنة بين المنتجات",
    "The online store has a comparison system between products to find out which is better. When you get the online store, you will enjoy the best additional services.": "يوجد في المتجر الالكتروني نظام المقارنة بين المنتجات لمعرفة ايهما افضل , عند حصولك على المتجر الالكترونى سوف تتمتع بافضل الخدمات الاضافية",
    "Advertising banners": "بنرات دعائية",
    "Spaces suitable for advertising banners of various sizes in a distinctive way that increases the customer’s desire to shop in your store": "مساحات مناسبة للبنرات الدعائية بمختلف الاحجام بشكل مميز يزيد الرغبة فى للزبون في التسوق في متجرك",
    "Wishlist": "قائمة رغبات",
    "Wish lists are available in your online store, and there is also a special account for each customer with a system of best wishes and favorites and a rating system for all products to improve your store’s sales.": "تتوفر قائمات الرغبات فى متجرك الالكترونى ويوجد ايضآ حساب خاص لكل زبون بنظام افضل الرغبات و المفضلة و نظام التقييم لجميع المنتجات للتحسين من مبيعات متجرك",
    "SSL certificate": "شهادة ssl",
    "Elevate trust and security! Our SSL certificates ensure encrypted connections for safeguarding sensitive data on your website.": "توفر شهادات SSL الخاصة بنا اتصالات مشفرة وآمنة لحماية البيانات الحساسة على الموقع الخاص بك، مثل بيانات البطاقات الائتمانية وغيره!",
    "We provide you with official emails in the name of your business that you can use for your supervisors to facilitate the communication process": "نتيح لك ايميلات رسمية بإسم نشاطك التجاري تستخدمها لك للمشرفين لتسهيل عملية التواصل",
    "E-commerce websites design": "تصميم المتاجر الالكترونية",
    "Our online store design services help you enter the world of e-commerce and get your own store and an accompanying mobile application that works on Android and iPhone devices.": "خدماتنا في تصميم المتاجر الإلكترونية تساعدك على دخول عالم التجارة الإلكترونية والحصول على متجرك الخاص وتطبيق جوال مصاحب يعمل على أجهزة أندرويد وآيفون.",
    "Request for a quote": "اطلب خدمتك الآن",

    "Our strategies aim to achieve the following three goals:": "تهدف استراتيجياتنا لتحقيق الأهداف الثلاثة التالية:",
    "Creativity in ways to attract the target audience to visit the website through social networks": "الابداع في طرق جذب الجمهور المستهدف لزيارة موقع الويب من خلال الشبكات الاجتماعية",
    "Supporting the site by enriching dialogue and spreading it through trustworthy people and sites": "دعم الموقع عن طريق اثراء الحوار والانتشار من خلال الاشخاص والمواقع ذات الثقة",
    "Attracting visitors through good content approved by search engines in order to target specific search terms.": "جذب الزوار من خلال محتوي جيد ومصادق لمحركات البحث بغرض استهداف كلمات بحثية معينة.",
    "Preparing websites for search engines (SEO).": "تهيئة المواقع لمحركات البحث SEO",
    "SEO is considered the most important source in attracting targeted visitors. We study your field, the market, and competitors, in order to develop the appropriate marketing plan that saves a lot of money and time and ensures that your site is prepared and appears in the first results. The appearance of your site in the first results of search engines is a great success, because This means that thousands of visitors and therefore customers will reach your site, which is what any company seeks.": "يعتبر سيو SEO اهم مصدر في جلب الزوار المستهدفين ،فنحن نقوم بدراسة مجالك، ودراسة السوق، والمنافسين ، حتى نضع الخطة التسويقية المناسبة التي توفر الكثير من المال والوقت وتضمن تهيئة موقعك وظهوره في النتائج الاولي ، فظهور موقعك في النتائج الأولى لمحركات البحث نجاح كبير، لأنه يعني وصول الآلاف من الزوار وبالتالي العملاء إلى موقعك وهو ما تسعى إليه أي شركة.",
    "Why is designing an online store an important step?": "لماذا تصميم متجر الكتروني يعد خطوة هامة؟",
    "We live in the era of digital development and technology, and designing an online store has become an indispensable thing for any business owner, which helps him promote and spread well in front of competitors in the field.": "نحن نعيش في عصر التطور الرقمي والتكنولوجيا، وأصبح تصميم متجر الكتروني شئ لا غنى عنه، لأي صاحب مشروع تجاري، والذي يساعده في الترويج والانتشار بشكل جيد، أمام المنافسين في المجال.",
    "SEO": "تهيئة محركات البحث",
    "We have a research team of specialists in on-page and off-page SEO, as well as PPC, i.e. payment for clicks in sponsored advertising campaigns such as Facebook and Google. We have a proven track record in increasing our clients’ search engine rankings.": "لدينا فريق بحث من المتخصصين في عمل السيو on-page و off-page وكذلك PPC اي الدفع مقابل النقرات في حملات الدعاية الممولة كالفيسبوك وجوجل ، لدينا سجل حافل في زيادة تصنيفات محرك البحث لعملائنا.",
    "See more": "المزيد",
    "The best web hosting and email services": "أفضل خدمات استضافة المواقع والبريد الإلكتروني",
    "Website hosting is one of the things that many business owners who want to start their business on the Internet are interested in, and it is one of the most important things that must be obtained when creating your website or online store.": "تعتبر استضافة المواقع الالكترونية من الأمور التي يهتم بها الكثير من أصحاب الأعمال الذين يريدون بدء عملهم على الانترنت، وهي من أهم الأشياء التي يجب الحصول عليها عند انشاء موقعك الالكتروني أو متجرك عبر الانترنت.",
    "Web Hosting": "استضافة مواقع",
    "Hosting features from Core Technology Solutions": "مميزات الاستضافة من كور تكنولوجى سوليوشنز",
    "CDN geographic spread technology": "تقنية الانتشار الجغرافي CDN",
    "It means disseminating data about the site using automated technology on the “Content Delivery Network”, which are connected distribution points around the world, which ensure quick browsing of the site in a way that achieves the maximum possible benefit for the site and its owner.": "وتعني نشر البيانات الخاصة بالموقع بتقنية آلية على Content Delivery Network، وهي نقاط التوزيع المتصلة حول العالم، والتي تضمن تصفح سريع للموقع بما يحقق اقصى فائدة ممكنة للموقع وصاحبه.",
    "Protection from DDOS attacks": "الحماية من هجمات DDOS",
    "Core Technology Solutions provides its customers with the highest levels of protection against Internet hackers, and the presence of alternative servers in the event of a sudden service outage, so that the site is not affected at all, without customers and site visitors feeling it.": "توفر شركة كور تكنولوجى سوليوشنز لعملائها أقصى درجات الحماية ضد قراصنة الإنترنت، وتواجد السيرفرات البديلة في حال انقطاع الخدمة المفاجئ بحيث لا يتأثر الموقع نهائيًا، دون أن يشعر بذلك العملاء وزوار الموقع.",
    "We provide our customers with an SSL certificate that provides the highest levels of security for site browsers, by using a system for encrypting user data within the site. At the same time, the Google search engine adopts this certificate as one of the criteria for arranging search results.": "نمنح لعملائنا شهادة SSL التي توفر أقصى درجات الأمان لمتصفحي الموقع، وذلك باستخدام نظام تشفير بيانات المستخدمين داخل الموقع، في نفس الوقت يعتمد محرك البحث جوجل هذه الشهادة، كأحد المعايير لترتيب نتائج البحث.",
    "Why do customers prefer hosting with Core Technology Solutions?": "لماذا يفضل العملاء الاستضافة مع شركة كور تكنولوجى سوليوشنز؟",
    "The company provides its customers with advanced backups to protect the site from any malfunctions or emergency attacks.": "تقدم الشركة لعملائها نسخ احتياطية متقدمة لحماية الموقع من أي أعطال أو هجوم طارئ.",
    "The customer service department provides its services immediately, 24 hours a day.": "يقوم قسم خدمة العملاء على تقديم خدماته بشكل فوري على مدى 24 ساعة يوميًا.",
    "It uses the best and latest software and hosting.": "يستخدم أفضل وأحدث البرامج والاستضافات.",
    "Hosting is suitable for all platforms.": "تناسب الاستضافة جميع المنصات.",
    "It features a control panel that allows the site owner more flexibility and to make some modifications to the site that he deems necessary.": "تتميز بلوحة تحكم تتيح لصاحب الموقع المزيد من المرونة وإدخال بعض التعديلات التي يراها ضرورية على الموقع.",
    "Because the site enjoys great trust among users, it provides the opportunity to refund money in the event of dissatisfaction with the service within 30 days from the beginning of implementation.": "ولأن الموقع يتمتع بثقة كبيرة بين المستخدمين، فقد أتاح فرصة استرداد الأموال في حال عدم الرضا عن الخدمة خلال 30 يوما من بداية التنفيذ.",
    "Providing a permanent replacement service, which guarantees the continuity of service without interruption by 99.9% in the event that one of the devices suffers a sudden malfunction, as the replacement is provided immediately without any interruption to the service.": "توفير خدمة البديل الدائم والذي يضمن استمرار الخدمة دون انقطاع بنسبة 99.9% في حال تعرض أحد الأجهزة لعطل مفاجئ، حيث يتم توفير البديل     فورًا دون حدوث أي توقف للخدمة.",
    "Core Technology Solutions uses the latest storage methods, which operate with advanced NVME technology, which is 7 times faster than the speed of various media, and is considered one of the company's best features.": "تستخدم شركة كور تكنولوجى أحدث وسائل التخزين، التي تعمل بتقنية NVME المتقدمة، والتي تفوق سرعتها سرعة مختلف الوسائط ب 7 أضعاف،وهي تعتبر من أفضل ميزات الشركة.",
    "The site offers its customers the best offers, facilities, and various contracting packages.": "يقدم الموقع لعملائه أفضل العروض والتيسيرات وباقات التعاقد المتنوعة.",
    "Dear customer, do not hesitate to contact Core Technology Solutions for the best and safest possible hosting.": "لا تتردد عزيزي العميل في التواصل مع شركة كور تكنولوجى من أجل أفضل وأأمن استضافة ممكنة.",
    "To obtain this service, leave us your information and get a price quote": "للحصول على هذه الخدمة اترك لنا بياناتك واحصل على عرض سعر",
    "WordPress": "ووردبريس",
    "Programming and designing WordPress websites": "برمجة وتصميم مواقع الووردبريس",
    "We offer professional WordPress website design services at the cheapest prices. We also provide WordPress themes that include Arabic and English. Core Technology Solutions is also distinguished by providing distinctive designs for e-commerce websites, “e-commerce sites.” Core Technology Solutions services also include website design in the countries of Egypt. And the Emirates, Saudi Arabia, and Kuwait. There are also special designs for all fields of companies (medical - stores - commercial - hospitals - real estate - restaurants - contracting - car services and others)": "نقدم خدمات تصميم  مواقع الووردبريس WordPress الاحترافية بأرخص الاسعار ,كما نقدم ثيمات الووردبريس شامله اللغتين العربية والانجليزية , كما تتميز كور تكنولوجي سوليوشنز بتقديم تصميمات مميزة لمواقع التجارة الإلكترونية “مواقع ايكومرس “e-commerce ، كما تشمل خدمات كور تكنولوجي سوليوشنز لتصميم المواقع الالكترونية في  دول مصر والامارات والسعودية والكويت,كما يوجد تصميمات خاصة لجميع مجالات الشركات ( طبية – متاجر – تجارية – مستشفيات  - عقارية-  مطاعم – مقاولات– خدمات سيارات واخري )",
    "Features of WordPress website design from Solutions": "مميزات تصميم مواقع الووردبريس من سوليوشنز",
    "Secure and fast hosting": "استضافة امنة وسريعه",
    "We provide you with software security from hacking. We take care of our programming to be light and take into account browsing speed.": "نمنحك أمان في البرمجيات من الاختراق ، نراعي ببرمجتنا أن تكون خفيفه ونراعي سرعة التصفح.",
    "We add your site professionally to ensure that your site appears on search engines": "نضيف موقعك بشكل احترافى لضمان ظهور موقعك على محركات البحث",
    "Arabization and multilingualism": "تعريب وتعدد اللغات",
    "We Arabize any WordPress template you have without complexity and offer several language options for your site": "نقم بتعريب اي قالب ووردبريس لديك بدون تعقيد ونقدم خيارات لغات عديدة لموقعك",
    "Developing and updating the system in WordPress": "تطوير وتحديث النظام في الووردبريس",
    "Developing the system in WordPress to serve you. Our work is the result of the cooperation of a work team keen on accuracy and attention to all details": "تطوير النظام في الووردبريس لخدمتك ، أعمالنا نتاج تعاون فريق عمل حريص علي الدقة والعناية بكافة التفاصيل",
    "Professional theme design": "تصميم ثيم إحترافي",
    "Installing the theme with a control panel accompanying the design, we give you easy management": "تركيب الثيم مع لوحة تحكم مرافقة للتصميم ، نمنحك إدارة ميسرة",
    "WordPress website design for any field": "تصميم مواقع ووردبريس لأي مجال",
    "Design and development of WordPress for any field, news, artistic, personal, any field, themes that suit your field and put you at the forefront of distinguished sites.": "تصميم وتطوير الووردبريس لأي مجال , أخباري , فني , شخصي , أي مجال ، ثيمات تتناسب مع مجالك و يجعلك في صادرة المواقع المميزة",
    "Site division": "تقسيم الموقع",
    "Dividing the site into main and sub-sections, adding special pages, creating main and sub-menus for the site.": "تقسيم الموقع الى اقسام رئيسية واخرى فرعيه ، اضافات الصفحات الخاصه ، انشاء القوائم الرئيسية والفرعية للموقع",
    "Installing the software on the hosting": "تنصيب البرمجية على الاستضافة",
    "Installing all the necessary additions for the proper functioning of the site. We use the latest work techniques in programming and design": "تركيب كل الاضافات اللازمة من اجل العمل السليم للموقع ، نستخدم احدث تقنيات العمل في البرمجة والتصميم",
    "El Masria Kitchens": "مطابخ المصرية",

    "Designing a hotel and airline reservation website": "تصميم موقع حجز فنادق وطيران",
    "Jan 7, 2024": "7 يناير، 2024",
    "Mar 21, 2024": "21 مارس 2023",
    "Apr 9, 2024": "9 ابريل 2022",
    "Dec 5, 2024": "5 ديسمبر 2023",
    "Oct 11, 2023": "11 اكتوبر 2023",
    "12:00 Pm": "12:0 م",
    "Articles": "مقالات",
    "Programming": "برمجة",
    "Web Development": "تطوير مواقع",
    "Website Design": "تصميم مواقع",
    "Web Programming": "برمجة ويب",

    "E-commerce Advantages": "مزايا التجارة الإلكترونية",
    "Digital Market Presence": "التواجد في السوق الرقمية",
    "Online Business Opportunities": "فرص الأعمال عبر الإنترنت",
    "Enhanced Customer Reach": "تعزيز الوصول إلى العملاء",

    "Corporate Identity Online": "هوية الشركة على الإنترنت",
    "Top Web Design Services": "أفضل خدمات تصميم الويب",
    "Leading Website Design Egypt": "رواد تصميم المواقع الإلكترونية في مصر",
    "Business Web Solutions": "حلول الويب للأعمال",

    "Search Engine Optimization Tips": "نصائح لتحسين محرك البحث",
    "SEO Best Practices": "فضل ممارسات تحسين محركات البحث",
    "SEO Essentials": "أساسيات تحسين محركات البحث",

    "Designing a hotel and airline reservation website, such as Booking, according to the latest updates for the year 2024": "تصميم موقع حجز فنادق وطيران مثل booking وفق آخر تحديثات لعام 2024",
    "Kamel Mamdouh": "كامل ممدوح",
    "Reservation System Design": "تصميم نظام حجوزات",
    "Hotel and Airline Booking": "حجز قنادق وطيران",
    "Web Design Trends 2024": "تريندات 2024",
    "Designing a professional hotel and flight reservation website with pictures contributes to providing great control to the website owner, and the ability to communicate with customers to develop your company’s services. This requires obtaining a distinctive website design that is easy for the visitor to use when entering, and demonstrates the extent of the company’s excellence in providing its services. Through the article, we will present the best hotel reservation website design from ": "يساهم تصميم موقع حجز فنادق وطيران بالصور احترافي، في توفير قدرة تحكم كبيرة لمالك الموقع، و إمكانية التواصل مع العملاء لتطوير خدمات شركتك، ويتطلب ذلك الحصول على تصميم موقع مميز، يسهل على الزائر استخدامه عند الدخول، ويوضح مدى تميز الشركة، في تقديم خدماتها، وسوف نقدم من خلال المقال افضل تصميم موقع حجز فنادق من شركة كور تيكنولوجي سوليوشنز لتصميم المواقع.",
    "Designing a professional hotel and flight reservation website requires that your goal be clear, in order to obtain a great return on investment, so you must determine the type of field that you want to target its audience, by taking steps that provide an easy user experience for the visitor, and simple online payment methods, in addition to providing Means of communication with all countries of the world, and the ability to upload photos, to display your company’s and hotels’ services.": "يتطلب تصميم موقع حجز فنادق وطيران احترافي، أن يكون هدفك واضح، لتحصل على عائد استثماري كبير، لذا يجب عليك تحديد نوع المجال الذي ترغب في استهداف جمهوره،  من خلال اتخاذ الخطوات التي توفر تجربة استخدام سهلة للزائر، وطرق دفع بسيطة اون لاين، بالإضافة لتوفير وسائل تواصل مع كل بلدان العالم، وإمكانية رفع الصور، لعرض خدمات شركتك والفنادق.",
    "Design of a hotel and airline reservation website": " تصميم موقع حجز فنادق وطيران ",
    "You can now get an easy hotel reservation website design that provides you with the following:": "حيث يمكنك الآن الحصول على تصميم موقع حجز فنادق بصورة سهلة، يوفر لك ما يلي",
    "It provides the visitor to search by country, hotel name and city.": "يوفر للزائر البحث من خلال البلد واسم الفندق والمدينة.",
    "Through it, the customer can book the room he wants.": "يتمكن العميل من خلالها من حجز الغرفة التي يريدها.",
    "CTS Company provides you with an easy-to-use control panel in all languages, enabling you to send and receive reservation requests from customers.": "توفر لك شركة كور تكنولوجي لوحة تحكم سهلة الأستخدام بكل اللغات، تمكنك من ارسال واستقبال طلبات الحجوزات من العملاء.",
    "The design of your website for booking hotels also provides easy and multiple payment methods, whether a bank account or a Visa.": "كما يتوفر في تصميم موقعك لحجز الفنادق، طرق سهلة للدفع ومتعددة سواء حساب بنكي او فيزا.",
    "It is a suitable site for viewing on all devices, whether mobile or desktop.": "ويعد موقع مناسب للعرض في كل الأجهزة، سواء جوال أو أجهزة سطح المكتب.",
    "Airline reservation website design specifications": "مواصفات تصميم موقع حجز طيران",
    "The hotel reservation website design specifications from Core Technology Solutions Company are characterized by professionalism, as they help you communicate well with customers, the most prominent of which are the following:": "تمتاز مواصفات تصميم موقع حجز فنادق  من شركة كور تيكنولوجي سوليوشنز بالأحترافية،  حيثتساعدك في التواصل بصورة جيدة مع العملاء، ومن أبرزها ما يلي: ",
    "You will get an innovative, professional airline booking website design, which will help you attract customers attention.": "سوف تحصل على تصميم موقع حجز طيران احترافي مبتكر ، يساعدك في جذب انتباه العملاء.",
    "We will also provide you with a logo design for the company, indicating its commercial identity.": "كما سنوفر لك تصميم شعار للشركة، يدل على هويتها التجارية. ",
    "You will get a control panel that is easy to control in foreign and Arabic languages.": "ستحصل على لوح تحكم يسهل التحكم فيها باللغة الأجنبية، والعربية.",
    "We will provide coding for all pages.": "وسوف نوفر تكويد لجميع الصفحات.",
    "We will also allocate a special panel for site members, and special programming.": "كما سنخصص لوحة خاصة لاعضاء الموقع، وبرمجة خاصة.",
    "We will also provide multiple payment methods, suitable for all customers, in addition to providing you with professional archiving services.": "كما سنوفر وسائل متعددة للدفع، تناسب كل العملاء، بالإضافة لحصولك على خدمات ارشفة احترافية.",
    "We will also protect your site against electronic attacks, and provide server protection.": "كما سنحمي موقعك ضد الهجمات الإلكترونية، ونوفر حماية للسيرفر.",
    "You can add bank accounts through it, send a message with the amount, deposit and pay.": "يمكنك إضافة الحسابات البنكية من خلاله،  ارسال رسالة بالمبلغ، والإيداع والدفع.",
    "Design standards for the flight reservation website Booking website for booking airline tickets and hotels": "معايير تصميم موقع حجز الطيران موقع بوكينج لحجز تذاكر الطيران والفنادق",
    "We present to you the standards for designing a flight reservation website. Booking.com is a distinctive website for booking airline tickets and hotels. It will help you stand out from your competitors and get ahead of them. They are as follows:": "قدم لك  معايير  تصميم موقع حجز الطيران موقع بوكينج لحجز تذاكر الطيران والفنادق مميز، سوف يساعدك في التميز على منافسيك والتقدم عليه، وتتمثل فيما يلي:",
    "You must provide high-quality images in the design of the hotel reservation website that you want customers to book, showing all the details within it, and being coordinated in a smooth, sequential manner, while explaining the features of the place.": "يجب توفير صور عالية الجودة في تصميم موقع حجز فنادق التي تريد من العملاء حجزها، يتضح بها كل التفاصيل داخلها، وتكون منسقة متعاقبة بشكل انسيابي، مع توضيح مميزات المكان. توفير تجربة مستخدم سهلة",
    "You must provide an easy user experience for the visitor to your site, while browsing your site and viewing images, without facing problems of difficulty loading images, or difficulty browsing, which would cause him to leave your site without returning.": "يجب أن توفر تجربة استخدام سهلة للزائر لموقعك، خلال تصفحه لموقعك، ومشاهدة الصور، بدون مواجهة مشاكل صعوبة تحميل الصور، أو صعوبة التصفح، تجعله يغادر موقعك بدون رجعة.",
    "Protecting your site from electronic attacks requires providing a valid security certificate for the site, which makes it provide optimal response to customers, on all phones, computers, and tablets.": "يتطلب حماية موقعك من الهجمات الإلكترونية، توفير شهادة أمان صالحة للموقع، تجعله يوفر استجابة مثالية للعملاء، على كل أجهزة الهواتف، وأجهزة الكمبيوتر، والأجهزة اللوحية.",
    "Requirements for creating an airline tickets and hotels website": "متطلبات إنشاء موقع تذاكر طيران وفنادق",
    "One of the most important requirements for creating an airline tickets and hotel website is to have a set of skills, in order to have a professional website that motivates customers to request your services. Its steps are as follows:": "تعد من أهم متطلبات إنشاء موقع تذاكر طيران و فنادق، امتلاك مجموعة من المهارات، للحصول على موقع احترافي، يحفز العملاء لطلب خدماتك، وتتمثل خطواته فيما يلي: ",
    "Use modern colors for the website that attract attention and suit your commercial identity.": "استخدام الوان عصرية للموقع، تلفت الانتباه، وتناسب هويتك التجارية.",
    "Design a logo for your company that distinguishes it from competing companies.": "تصميم شعار لشركتك، يميزها عن الشركات المنافسة.",
    "Choosing a wonderful, unique and innovative design for your hotel and flight reservation website will attract customers’ attention.": "اختيار تصميم رائع و فريد ومبتكر لموقعك لحجز الفنادق والطيران، يلفت انتباه العملاء.",
    "The site design is compatible with all mobile and web devices.": "تناسب تصميم الموقع مع كل اجهزة الجوال والويب.",
    "There must also be a control panel that makes it easy to manage the site in all languages, with simple payment methods available on the site for booking hotels.": "كما يجب  وجود لوح  تحكم يسهل إدارة الموقع بواسطتها بكل اللغات، مع توفر طرق دفع على الموقع بسيطة لحجز الفنادق.",
    "Having an account for each user with all his data and all the operations he carried out.": "وجود حساب لكل مستخدم بكل بياناته وجميع العمليات التي نفذها.",
    "Create a website for booking airline tickets and hotels with a commission": "إنشاء موقع حجز تذاكر طيران وفنادق بالعمولة",
    "The specifications for creating a website for booking airline tickets and hotels with a commission from the best website design company in Egypt and the Arab world, are as follows:": "تمتاز مواصفات إنشاء موقع حجز تذاكر طيران و فنادق بالعمولة في أفضل شركة تصميم مواقع في مصر والوطن العربي كور تيكنولوجي سوليوشنز، فيما يلي:",
    "Providing innovative, unique and easy-to-use specifications for the website owner.": "تقديم  مواصفات مبتكرة وفريدة وسهلة الاستخدام لمالك الموقع.",
    "The client gets the best hotel and airline reservation website design at a simple price.": "يحصل العميل على أفضل تصميم موقع حجز فنادق وطيران  بسعر بسيط.",
    "We also have a team of experts and programmers in the field of design professionally.": "كما  يتوفر لدينا فريق من الخبراء والمبرمجين في مجال التصميم بصورة احترافية.",
    "We also determine the lowest cost for designing the hotel website, provide you with a control panel that is easy for you to use, and communicate with customers in all countries of the world.": "كذلك  نحدد أقل تكلفة لتصميم موقع الفندق، ونوفر لك لوحة تحكم يسهل عليك استخدامها، والتواصل مع العملاء في كل بلدان العالم.",
    "We also design a professional logo for you, and provide you with technical support services even after the product is delivered, to solve any problems with our hotel website designs.": "كما نصمم لك شعار احترافي، ونوفر لك خدمات الدعم الفني حتى بعد تسليم المنتج، لحل أي مشاكل تصميمات مواقع الفنادق لدينا.",
    "The hotel website design is also compatible with all search engines and exchange systems.": "كذلك يعد تصميم موقع الفنادق متوافق مع كل محركات البحث وأنظمة الصرف.",
    "How to create, program and design a hotel reservation website": "كيفية انشاء وبرمجة وتصميم موقع حجز فنادق",
    "A hotel and flight reservations website can be created, programmed, and designed by following the following steps:": "مكن انشاء وبرمجة و تصميم موقع حجز فنادق  وحجوزات طيران ،من خلال اتباع الخطوات التالية:",
    "Define goals clearly.": "تحديد الأهداف بصورة واضحة",
    "Determine target groups.": "حديد الفئات المستهدفة",
    "Site planning.": "التخطيط للموقع",
    "Domain and hosting.": "النطاق والاستضافة",

    "Website programming and development - programming, design and development of websites": "برمجة وتطوير المواقع – برمجة وتصميم وتطوير المواقع الالكترونية",
    "website": "موقع الكتروني",
    "Website programming and development": "برمجة وتطوير المواقع",
    "Programming, design and development of websites": "برمجة وتصميم وتطوير المواقع الالكترونية",
    "Website design from AST Solutions is more than just designing a website on the Internet, because the digital world is governed by first impressions, and we work to make an impressive impression from the beginning and designing a distinctive website is the key to success in light of the Internet era that we live in now, where We start working directly with you to transform your ideas into a successful and inspiring website. Website programming and development - programming, design and development of websites.": "تصميم مواقع انترنت  من كور تيكنولوجي سوليوشنز هو أكثر من مجرد تصميم موقع الكتروني على شبكة الانترنت هذا لأن العالم الرقمي تحكمه الانطباعات الأولى , ونحن نعمل على ان يكون انطباع مبهر من البداية وتصميم موقع الكتروني مميز هو مفتاح النجاح في ظل عصر الانترنت الذي نعيشة الأن حيثُ نبدأ العمل مباشرة معك لتحويل أفكارك إلى موقع الكتروني ناجح ومُلهم ، برمجة وتطوير المواقع – برمجة وتصميم وتطوير المواقع الالكترونية.",
    "If you are looking to design a new website for your company project, you can browse our previous work. We work from a standpoint of innovation and experience, as we help companies develop their work by designing a website that presents what they have professionally to reflect the extent of their uniqueness in providing their services and products. We are able to do this through Your site, God willing. Our approach to website design begins with placing your activity and business on the Internet, earning more sales, and discovering more opportunities in this distinguished, fast-paced market.": "إذا كنت تبحث عن تصميم موقع الكتروني جديد لمشروعك لـ شركتك ، يمكنك تصفح سابقة أعمالنا فنحن نعمل من منطلق الإبتكار والخبرة حيثُ نساعد الشركات على التطوير عملهم من خلال تصميم موقع يقدم ما لديها بإحترافية ليعكس مدى انفراديتها في تقديم خدماتها ومنتجاتها ، فنحن قادرون على ذلك من خلال موقعك بإذن الله. نهجنا في تصميم المواقع يبدأ بوضع نشاطك وتجارتك على شبكة الانترنت وكسب المزيد من المبيعات واكتشاف المزيد من الفرص في هذا السوق المميز السريع.",
    "We offer a wide range of different services and options that include website design, electronic marketing, mobile application programming, and online store design. With AST Solutions, you will gain your place in the online and mobile world and build a personality for your brand that will have a long-term impact on your customers. We believe that design makes a difference because the first impression lasts. AtCore Technology Solutions, websites must undergo rigorous testing for all types of devices, as well as different browsers and operating systems, before we launch your new website. User tests are conducted periodically to ensure the site is up to date and responsive. Our team develops effective content strategies, and we have a proven track record of success partners that is constantly increasing. We have previous work in Kuwait, Saudi Arabia and Egypt.": "حن نقدم مجموعة واسعة من الخدمات والخيارات المختلفة التي تشمل  تصميم مواقع الانترنت  ،  التسويق الالكترني  ،  برمجة تطبيقات الجوال  ،  تصميم متاجر الكترونية . مع كور تيكنولوجي سوليوشنز سوف تحصل على مكانك في عالم الانترنت والجوال وبناء شخصية لعلامتك التجارية ذات أثر طويل الأمد لدى عملاؤك. ونحن نعتقد أن التصميم يحدث فرقا وذلك لان الانطباع الاول يدوم ، فى كور تيكنولوجي سوليوشنز يجب أن تخضع المواقع الإلكترونية لأختبارات صارمة لجميع أنواع الأجهزة وكذلك المتصفحات المختلفة وأنظمة التشغيل قبل أن ننطلق بالموقع الجديد الخاص بكم. ويتم إجراء اختبارات للمستخدم لضمان حداثة واستجابة الموقع بشكل دوري. فريقنا يطور استراتيجيات المحتوى الفعال ، ولدينا سجل حافل من شركاء النجاح وفي زيادة مستمرة . لدينا سابقة اعمال في الكويت السعودية و مصر.",

    "importance of creating and designing online stores": "اهمية انشاء وتصميم متاجر الكترونية",
    "What is the importance of creating and designing online stores?": "ما اهمية انشاء وتصميم متاجر الكترونية؟",
    "Designing electronic stores. You can now benefit from the Internet by designing an electronic store from Core Technology Solutions and displaying all the products that you want to display and market on the Internet. Technological development has made the Internet a large market on which many products can be sold, starting from clothes to real estate. This is why the E-commerce company is interested in ST Solutions provides an online store design service at the best prices.": "تصميم المتاجر الإلكترونية ، يُمكنك الآن ألاستفادة من الإنترنت من خلال تصميم متجر إلكتروني من كور تيكنولوجي سوليوشنز وعرض عليه كافة المُنتجات التي تُريد عرضها وتسويقها على الإنترنت فالتطور التكنولوجي جعل الإنترنت سوق كبير يُمكن بيع العديد من المُنتجات عليه بداية من الملابس حتى العقارات ولهذا تهتم شركة كور تيكنولوجي سوليوشنز بتقديم خدمة تصميم متجر إلكتروني بأفضل الأسعار.",
    "The importance of creating and designing online stores": "اهمية انشاء وتصميم متاجر الكترونية",
    "All young people and adults also now do not go by a single day without connecting to the Internet and browsing everything new. The Internet has become a daily means of communication through social networking sites and has also become a means of communication at work. Every large company has a website through which the company’s employees communicate in addition to publishing an introduction to the company and what it offers. on the Internet.": "جميع الشباب والكبار أيضاً الآن لا يمر عليهم يوم واحد دون الإتصال بالانترنت وتصفح كل جديد فأصبح ألإنترنت وسيلة التواصل اليومية من خلال مواقع التواصل الاجتماعي وأصبح أيضًا وسيلة تواصل في العمل فكل شركة كبيرة لديها موقع إلكتروني يتواصل من خلاله العاملين بالشركة بالإضافة إلى نشر تعريف بالشركة وما تُقدمه على الإنترنت.",
    "All companies, large institutions and small projects now have their own website, and small business owners market their products on the Internet through it. When you own an online store, you can market your products on it with ease and at much cheaper prices than traditional marketing. It is known that electronic marketing is less expensive and more profitable than traditional marketing. Therefore, I advise you to own an online store with a distinct design that will save you time and effort and help you achieve success.": "كل الشركات والمؤسسات الكبيرة والمشاريع الصغيرة أصبحت تمتلك موقع إلكتروني خاص بها ويقوم أصحاب المشاريع الصغيرة بتسويق مُنتجاتهم على ألإنترنت من خلاله وعند امتلاكك لمتجر إلكتروني يُمكنك تسويق مُنتجاتك عليه بكل سهولة وبأسعار أرخص بكثير من التسويق التقليدي فمن المعروف أن التسويق الإلكتروني أقل تكلفة وأكثر ربحًا من التسويق التقليدي لهذا فأنصحك بامتلاك متجر إلكتروني بتصميم مُتميز يوفر لك الوقت والجهد ويُساعدك على تحقيق النجاح.",
    "Many people use the Internet to obtain information, shop, or communicate with friends, relatives, and acquaintances. Therefore, you will find many customers on the Internet who are interested in your products and buy them. Here in our company, we also design an online store for you. We will also help you in the electronic marketing process in the first three months of the year. Through our special offers, you can renew the marketing service at any time.": "العديد من الناس يستخدم ألإنترنت في الحصول على المعلومات أو التسوق أو التواصل مع الأصدقاء والأقارب والمعارف لهذا ستجد العديد من العملاء على الإنترنت الذين يهتمون بمُنتجاتك ويشترونها وهُنا في شركتنا كما نقوم بتصميم متجر إلكتروني لك سوف نقوم أيضًا بمُساعدتك في عملية التسويق الإلكتروني في أول ثلاثة شهور من خلال عروضنا المُميزة ويُمكنك تجديد خدمة التسويق في أي وقت.",
    "You must know that when you have an online store in which you display your products, you will have a gateway to the whole world and through it your business activity will extend from the local scope to the entire world, and this is our mission during the first period of launching your online store.": "يجب أن تعرف أنه عندما يكون لديك متجر إلكتروني تعرض فيه منتجاتك بهذا سوف تكون لديك بوابة على العالم كله ويمتد من خلالها نشاطك التجاري من النطاق المحلي إلى العالم بأكمله وهذه هي مهمتنا خلال الفترة الأولى من إطلاق المتجر الإلكتروني الخاص بك.",
    "After designing an online store, we can help you increase your profits through many methods, including:": "بعد تصميم متجر إلكتروني يُمكننا مُساعدتك في زيادة أرباحك من خلال العديد من الطرق ومنها:",
    "Preparing websites for search engines - SEO - This way you can attract visitors interested in your products from search engines at no cost by preparing your own website and working on it through our work team so that your online store appears at the top of the results.": "تهيئة المواقع لمحركات البحث – SEO – وبهذا تستطيع جلب زوار مُهتمين بمُنتجاتك من محركات البحث بدون أي تكلفة من خلال تهيئة الموقع الخاص والعمل عليه من خلال فريق العمل لدينا ليظهر متجرك الإلكتروني في مُقدمة النتائج.",
    "Social media sites - through which you can get visitors from social media sites, such as sponsored advertisements on Facebook and Twitter, by interacting with customers and making ads with very precise targeting by specifying interests and other factors through which you can achieve the highest results from the visits you receive. will come to your site.": "مواقع التواصل الاجتماعي – Social Media – ومن خلالها يُمكنك الحصول على زوار من مواقع التواصل الاجتماعي مثل اعلان ممول علي الفيسبوك وتويتر من خلال التفاعل مع العملاء وعمل إعلانات باستهداف دقيق جداً من خلال تحديد ألاهتمامات وغيرها من العوامل التي تستطيع من خلالها تحقيق أعلى نتائج من الزيارات التي ستأتي لموقعك.",
    "Paid Google ads - Google Adwords - are ads that you can benefit from to achieve very large profits because through Google campaigns you will pay by click or by views. This means that if you adjust the advertising campaign well, you will get very interested customers.": "إعلانات جوجل المدفوعة – Google Adwords – وهي إعلانات يُمكنك ألاستفادة منها في تحقيق أرباح بشكل كبير جدا لأنك من خلال حملات جوجل ستدفع بالنقرة أو بالمشاهدات ومعنى هذا أنك إذا قُمت بضبط الحملة الإعلانية بشكل جيد سوف تحصل على عملاء مُهتمين بشكل كبير جداً.",
    "And many other ways that you will learn about us atCore Technology Solutions when you contact us to start designing your own online stores.": "والعديد من الطرق الأخرى التي ستتعرف عليها لدينا في كور تيكنولوجي سوليوشنز عند التواصل معنا للبدء في تصميم متاجر إلكترونية خاص بك.",

    "Corporate website design - the best website design company in Egypt": "تصميم مواقع الشركات – أفضل شركة تصميم مواقع في مصر",
    "Core Technology Solutions provides a website design service for companies and institutions that seek excellence through a sophisticated interface on the Internet. We do not only provide website design for companies, but also integrated solutions and a distinctive identity for your company or organization. We create the website in a way that is compatible with search engines. And all internet browsers, mobile devices, tablets, iPhones, etc., in a manner consistent with international standards in designing and programming corporate websites.": "تقدم كور تيكنولوجي سوليوشنز خدمة تصميم مواقع الكترونية للشركات والمؤسسات التي تسعي الي التميز من خلال واجهة راقية علي شبكة الانترنت ، فنحن لا نقدم تصميم مواقع للشركات وحسب ، وانما حلول متكاملة وهوية مميزة لشركتك او مؤسستك، فنحن نقوم بإنشاء الموقع الالكتروني بما يتناسب مع محركات البحث و جميع متصفحات الانترنت و أجهزة الجوال والتابلت والأي فون وغيرها وبما يتناسب مع المعايير العالمية في تصميم وبرمجة مواقع الشركات.",
    "Website design for companies": "تصميم مواقع للشركات",
    "The best website design company in Egypt. AST Solutions designs and programs websites in the latest programming languages and in a way that suits the capabilities of its clients in various fields, and in professional ways in designing distinctive websites. It is also distinguished by designing websites compatible with all browsers and screens of all sizes. The company is also distinguished by designing websites. Companies that are compatible and friendly to search engines, in addition to a complete control panel that is simple to use, to save the customer time and money, enabling our customers to use the sites easily and the ability to add or change any of the site content easily.": "أفضل شركة تصميم مواقع في مصر تقوم كور تيكنولوجي سوليوشنز بتصميم وبرمجة المواقع بأحدث لغات البرمجة وبما يتناسب مع امكانيات عملائها في شتي المجالات ، وبطرق احترافية في تصميم مواقع مميزة ، وايضا تتميز بتصميم مواقع متوافقة مع جميع المتصفحات والشاشات بكافة احجامها ، كما تتميز الشركة بتصميم مواقع شركات متوافقة وصديقة لمحركات البحث ، بالاضافة الي لوحة التحكم الكاملة البسيطة في التعامل ، لتوفر علي العميل الوقت والمال مما يمكن عملائنا من استخدام المواقع بسهولة وامكانية اضافة او تغيير اي من محتوي الموقع بسهولة.",
    "What distinguishes website design from our company:": "ما يميز تصميم المواقع من شركتنا:",
    "What distinguishes us is understanding and realizing the client’s requirements and good planning before starting work.": "ان ما يميز هو فهم وادراك متطلبات العميل والتخطيط الجيد قبل الشروع في العمل.",
    "All sites come with a complete control panel to control the site without the need to return to the company.": "كل المواقع تأتي بلوحة تحكم كاملة للتحكم في الموقع دون الحاجة للرجوع للشركة.",
    "We provide complete and complete protection for websites on our servers.": "نوفر الحماية التامة والكاملة للمواقع علي سيرفراتنا.",
    "Good planning when designing websites for places to place advertising banners to be more effective.": "التخطيط الجيد عند تصميم المواقع لأماكن وضع البنرات الدعائية لتكون أكثر فعالية.",
    "Relying on simplicity in website design to make visitors comfortable and stay on the site for as long as possible.": "الاعتماد على البساطة في تصميم المواقع لراحة الزائرين للموقع والبقاء اطول مدة ممكنة.",
    "Reducing website loading time by avoiding flash drives and software that may affect the speed of loading the website and archiving it in search engines.": "اختصار زمن تحميل المواقع من خلال البعد عن الفلاشات والبرمجيات التي قد تؤثر علي سرعة تحميل الموقع وارشفته في محركات البحث.",
    "We provide all corporate website design services that will bring you more exposure and thus more customers and sales at much lower prices.": "نقدم جميع خدمات تصميم مواقع الشركات الذي يحقق لك المزيد من الأنتشار وبالتالي المزيد من العملاء والمبيعات وبأسعار أقل بكثير.",
    "Rank at the top and appear in the first search results by designing a website compatible with search engines": "تصدر القمة واظهر فى نتائج البحث الأولى من خلال تصميم موقع الكتروني متوافق مع محركات البحث",
    "We design websites according to the rules of search engines to help your customers find your site faster, while archiving the site so that you get all the permissions to place words and semantic phrases with every product and every section of the site, as well as alternative texts to tell the search engines that you exist and that you have what your customers are looking for.": "نقوم بتصميم مواقع وفقا لقواعد محركات البحث لنساعد عملاءك فى العثورعلى موقعك بشكل اسرع مع أرشفة الموقع بحيث تحصل على كل الصلاحيات لوضع الكلمات والعبارات الدلالية مع كل منتج وكل قسم من أقسام الموقع وكذلك النصوص البديلة كى تخبر محركات البحث أنك موجود وأن لديك مايبحث عنه عملاءك",
    "Understanding SEO – Is It Really Necessary?": "فهم تحسين المواقع الالكترونية لمحركات البحث – هل هو ضروري حقًا؟",
    "It seems like every time we turn around there's a new, seemingly simple acronym for a concept that ends up feeling cosmically infinite just by looking at it. Search Engine Optimization (SEO) is one of those concepts that you have definitely heard about or seen in articles by now. It's also one that can be a head-scratcher at first glance.": "يبدو أنه في كل مرة نستدير فيها يوجد اختصار جديد يبدو بسيطًا لمفهوم ينتهي به الأمر إلى الشعور بأنه لانهائي كونيًا بمجرد النظر إليه. يعد تحسين محركات البحث (SEO) أحد تلك المفاهيم التي سمعت عنها أو رأيتها بالتأكيد في المقالات الآن. إنها أيضًا واحدة يمكن أن تكون خدشًا للرأس للوهلة الأولى.",
    "Marketing teams have become widespread advocates of SEO, with companies creating entirely new roles dedicated just to it. But what if you are only one creator? Is SEO really important? Or is it something only big companies have to worry about?": "أصبحت فرق التسويق على نطاق واسع من المدافعين عن تحسين محركات البحث (SEO)، حيث قامت الشركات بإنشاء أدوار جديدة تمامًا مخصصة لهذا الأمر فقط. ولكن ماذا لو كنت منشئًا واحدًا فقط؟ هل تحسين محركات البحث مهم حقًا؟ أم أنه شيء يجب على الشركات الكبيرة فقط أن تقلق بشأنه؟",
    "First, let's understand what search engine optimization (SEO) is and how it works.": "أولاً، دعنا نتعرف على ماهية تحسين محركات البحث (SEO) وكيف تعمل.",
    "What is search engine optimization?": "ما هو تحسين محركات البحث؟",
    "SEO stands for search engine optimization. It sounds very technical but it has practical uses for anyone creating and/or publishing content online (yes, even on social media).": "يشير SEO إلى تحسين محركات البحث. يبدو الأمر تقنيًا للغاية ولكن له استخدامات عملية لأي شخص يقوم بإنشاء و/أو نشر محتوى عبر الإنترنت (نعم، حتى على وسائل التواصل الاجتماعي).",
    "In essence, Search Engine Optimization (SEO) is used with the goal of getting greater volume and higher quality organic traffic. Think about it: People search for things on the Internet all the time. So how does Google know what results to give them? Search engine optimization (SEO) helps people find what they are looking for.": "في جوهر الأمر، يتم استخدام تحسين محركات البحث (SEO) بهدف الحصول على حجم أكبر وحركة مرور عضوية أعلى جودة . فكر في الأمر: يبحث الأشخاص عن أشياء على الإنترنت طوال الوقت. فكيف تعرف جوجل ما هي النتائج التي تقدمها لهم؟ يساعد تحسين محركات البحث (SEO) الأشخاص في العثور على ما يبحثون عنه.",
    "Search engine optimization (SEO) uses keywords and other techniques that make it easier for Google (and other search-based social platforms like Pinterest) to understand what your content is about. For example, if someone searches for “quick vegan enchilada recipe” and you have a blog post or video that includes your vegan enchilada recipe, you can use SEO to tell Google that your content is relevant.": "يستخدم تحسين محركات البحث (SEO) الكلمات الرئيسية والأساليب الأخرى التي تسهل على Google (والأنظمة الأساسية الاجتماعية الأخرى القائمة على البحث مثل Pinterest) فهم موضوع المحتوى الخاص بك. على سبيل المثال، إذا كان شخص ما يبحث عن “وصفة إنشيلادا نباتية سريعة” وكان لديك مشاركة مدونة أو مقطع فيديو يتضمن وصفة الإنشيلادا النباتية الخاصة بك، فيمكنك استخدام تحسين محركات البحث لإخبار Google بأن المحتوى الخاص بك ذو صلة.",
    "Without SEO, there is a high probability that Google will not be able to read your content as relevant. Instead of appearing on page 1 of a search, they may appear on page 11. It is unlikely that someone will stay on a search long enough to get to page 11.": "بدون تحسين محركات البحث، هناك احتمال كبير بأن Google لن يتمكن من قراءة المحتوى الخاص بك على أنه ذو صلة. بدلاً من الظهور في الصفحة 1 من البحث، قد تظهر في الصفحة 11. ومن غير المحتمل أن يبقى شخص ما في البحث لفترة كافية للوصول إلى الصفحة 11.",
    "A quick course on how to use search engine optimization (SEO).": "دورة تدريبية سريعة حول كيفية استخدام تحسين محركات البحث (SEO).",
    "As a content creator, there is one key factor you can start using today that will dramatically improve the searchability of your content: keywords. There are other factors attributed to SEO, but keywords carry a lot of weight and are a simple way to get started.": "باعتبارك منشئ محتوى، هناك عامل رئيسي واحد يمكنك البدء في استخدامه اليوم والذي سيؤدي إلى تحسين إمكانية البحث في المحتوى الخاص بك بشكل كبير: الكلمات الرئيسية . هناك عوامل أخرى تنسب إلى تحسين محركات البحث، لكن الكلمات الرئيسية لها وزن كبير وهي طريقة بسيطة للبدء.",
    "Keywords help define the topic of your content. Think of it as a bridge between the content you create and what people are searching for.": "تساعد الكلمات الرئيسية في تحديد موضوع المحتوى الخاص بك. فكر فيها كجسر بين المحتوى الذي تقوم بإنشائه وما يبحث عنه الأشخاص.",
    "When someone starts typing a query into Google, suggestions appear. These are good examples of potential keywords to focus on. It's an easy way to do some quick keyword research if you're not sure where to start (more on keyword research below).": "عندما يبدأ شخص ما في كتابة استعلام في Google، تظهر الاقتراحات. هذه أمثلة جيدة للكلمات الرئيسية المحتملة التي يجب التركيز عليها. إنها طريقة سهلة لإجراء بعض البحث السريع عن الكلمات الرئيسية إذا لم تكن متأكدًا من أين تبدأ (المزيد حول البحث عن الكلمات الرئيسية أدناه).",
    "Types of keywords": "أنواع الكلمات الرئيسية",
    "There are two main types of keywords: short-tail and long-tail.": "هناك نوعان رئيسيان من الكلمات الرئيسية: قصيرة الذيل وطويلة الذيل.",
    "Short keywords often consist of one or two words that cover a very broad topic. The problem with short-tail keywords is that they cover a wide range, resulting in a lot of competition for search results position on the first page.": "غالبًا ما تتكون الكلمات الرئيسية القصيرة من كلمة أو كلمتين تغطي موضوعًا واسعًا جدًا. تكمن مشكلة الكلمات الرئيسية قصيرة الذيل في أنها تغطي نطاقًا واسعًا، مما يؤدي إلى وجود منافسة كبيرة على موضع نتائج البحث في الصفحة الأولى.",
    "However, long-tail keywords will be your bread and butter. They sound more like phrases and have a clearly defined intent.": "ومع ذلك، فإن الكلمات الرئيسية الطويلة ستكون بمثابة خبزك وزبدتك. إنها تبدو أشبه بالعبارات ولها نية محددة بوضوح.",
    "Let's revisit the vegetarian enchilada research.": "دعونا نعيد النظر في بحث الانتشيلادا النباتي.",
    "A short keyword might be “vegetarian enchiladas.” Since this is a broad concept, your content is unfortunately likely to get lost in the sauce. Not only will you be competing with other recipes, you may be competing with products being sold like frozen vegan enchiladas or vegan enchilada cheese.": "قد تكون الكلمة الرئيسية القصيرة هي “الانتشلادا النباتية”. نظرًا لأن هذا مفهوم واسع، فمن المرجح للأسف أن يضيع المحتوى الخاص بك في الصلصة. لن تتنافس مع الوصفات الأخرى فحسب، بل ربما تتنافس مع المنتجات التي يتم بيعها مثل الانشيلادا النباتية المجمدة أو جبن الانشيلادا النباتي.",
    "However, the “quick vegetarian enchilada recipe” is more specific and has a clear purpose. There will be less competition from those ingredients or products mentioned earlier.": "ومع ذلك، فإن “وصفة الانشيلادا النباتية السريعة” أكثر تحديدًا ولها غرض واضح. ستكون هناك منافسة أقل من تلك المكونات أو المنتجات المذكورة سابقًا.",
    "It's worth noting that you don't want to get too niche with your long-tail keywords, because even though the competition may be less, it probably won't be a realistic query someone would type into the search bar.": "تجدر الإشارة إلى أنك لا ترغب في الدخول في نطاق متخصص جدًا باستخدام كلماتك الرئيسية الطويلة، لأنه على الرغم من أن المنافسة قد تكون أقل، إلا أنه من المحتمل ألا يكون استعلامًا واقعيًا يكتبه شخص ما في شريط البحث.",
    "You want to hit that sweet spot between not too vague and not too specific. A good way to achieve this is to keep your long-tail keywords between 3 to 5 words.": "تريد أن تصل إلى تلك النقطة الجميلة بين ليست غامضة جدًا وليست محددة جدًا. إحدى الطرق الجيدة لتحقيق ذلك هي الاحتفاظ بكلماتك الرئيسية الطويلة بين 3 إلى 5 كلمات.",
    "Search for the keyword": "البحث عن الكلمه الرئيسيه",
    "In general, you want to have one primary keyword and two secondary keywords on the page/post you are optimizing.": "بشكل عام، تريد أن يكون لديك كلمة رئيسية أساسية واحدة وكلمتين رئيسيتين ثانويتين على الصفحة/المنشور الذي تقوم بتحسينه.",
    "As mentioned earlier, typing in some short-tail keywords and seeing what comes up in Google suggested searches is a good way to start identifying your long-tail keywords.": "كما ذكرنا سابقًا، تعد كتابة بعض الكلمات الرئيسية ذات الذيل القصير ورؤية ما يظهر في عمليات البحث المقترحة من Google طريقة جيدة للبدء في تحديد كلماتك الرئيسية ذات الذيل الطويل.",
    "Another easy way to find keywords is to use LSI (Latent Semantic Indexing) keywords. Don't worry about the fancy wording it represents. This is basically another quick Google search hack to find keywords.": "هناك طريقة أخرى سهلة للعثور على الكلمات الرئيسية وهي استخدام الكلمات الأساسية LSI (الفهرسة الدلالية الكامنة). لا تقلق بشأن الصياغة الفاخرة التي تمثلها. يعد هذا في الأساس اختراقًا سريعًا آخر لبحث Google للعثور على الكلمات الرئيسية.",
    "Let's say you know that your primary keyword is “quick vegetarian enchilada recipe.” LSI results are a good reference point for secondary keywords. These are the related searches you see at the bottom of the Google search page. Just scroll to the end of the page and voila!": "لنفترض أنك تعلم أن كلمتك الرئيسية الأساسية هي “وصفة الإنشيلادا النباتية السريعة”. تعد نتائج LSI نقطة مرجعية جيدة للكلمات الرئيسية الثانوية . هذه هي عمليات البحث ذات الصلة التي تراها أسفل صفحة بحث Google. فقط قم بالتمرير إلى نهاية الصفحة وها انت ذا!",
    "Keywords in action": "الكلمات الرئيسية في العمل",
    "*Locating/editing the meta description and ALT text varies slightly depending on your hosting platform. Check out the helpful links below if you're not sure where to find them!": "*يختلف تحديد موقع/تحرير الوصف التعريفي ونص ALT قليلاً اعتمادًا على منصة الاستضافة الخاصة بك. راجع الروابط المفيدة أدناه إذا لم تكن متأكدًا من مكان العثور عليها!",
    "For WordPress: Meta Description | Alt text": "بالنسبة إلى WordPress: الوصف التعريفي | نص بديل",
    "For Squarespace: Meta Description | Alt text": "بالنسبة لـ Squarespace: الوصف التعريفي | نص بديل",
    "If you're using a hosting platform other than these two, a quick Google search for your platform can give you the answers you need!": "إذا كنت تستخدم منصة استضافة غير هذين النظامين، فإن البحث السريع على Google عن النظام الأساسي الخاص بك يمكن أن يوفر لك الإجابات التي تحتاجها!",
    "This is where a lot of people get stuck. It may seem like a lot, but it's actually a very simple practice once you get the hang of it. In fact, you can even break up the keyword a bit in the sentence and Google will still recognize it.": "هذا هو المكان الذي يتعثر فيه الكثير من الناس. قد يبدو الأمر كثيرًا، لكنه في الواقع ممارسة بسيطة جدًا بمجرد أن تتقنها. في الواقع، يمكنك أيضًا تقسيم الكلمة الرئيسية قليلاً في الجملة وسيظل Google يتعرف عليها.",
    "Pro tip: What you don't want to do is what's called “keyword stuffing.” This happens when you use your keywords as many times as possible, “filling” the page with them. Google reads this as spam and your site can be penalized as a result.": "نصيحة احترافية: ما لا تريد فعله هو ما يسمى “حشو الكلمات الرئيسية”. يحدث هذا عندما تستخدم كلماتك الرئيسية أكبر عدد ممكن من المرات، مما يؤدي إلى “ملء” الصفحة بها. تقرأ Google هذا على أنه بريد عشوائي ويمكن معاقبة موقعك نتيجة لذلك.",
    "You want to use your keywords in a way that feels natural.": "تريد استخدام كلماتك الرئيسية بطريقة تبدو طبيعية.",
    "This is also where “keyword density” comes into play. Keyword density helps ensure your content is optimized, but not overstuffed. Good organic keyword density is between 1-2%.": "وهذا أيضًا هو المكان الذي تلعب فيه “كثافة الكلمات الرئيسية”. تساعد كثافة الكلمات الرئيسية على ضمان تحسين المحتوى الخاص بك، ولكن ليس حشوًا زائدًا. تتراوح كثافة الكلمات الرئيسية الأساسية الجيدة بين 1-2%.",
    "Some tools in your website hosting platform can help you calculate this. Otherwise, there are plenty of free keyword density calculators online.": "يمكن أن تساعدك بعض الأدوات الموجودة في منصة استضافة موقع الويب الخاص بك في حساب ذلك. بخلاف ذلك، هناك الكثير من الآلات الحاسبة المجانية لكثافة الكلمات الرئيسية عبر الإنترنت.",
    "The general rule for using keywords on a page is as follows:": "القاعدة العامة لاستخدام الكلمات الرئيسية على الصفحة هي كما يلي:",
    "In the page title and URL": "في عنوان الصفحة وعنوان URL",
    "In at least one title (H1 tags)": "في عنوان واحد على الأقل ( علامات H1 )",
    "In at least one subheading (H2 and H3 tags)": "في عنوان فرعي واحد على الأقل ( علامات H2 وH3 )",
    "In the first paragraph": "في الفقرة الأولى",
    "In the last paragraph": "في الفقرة الأخيرة",
    "In the meta description*": "في الوصف التعريفي*",
    "In the alt text of a single image*": "في النص البديل لصورة واحدة *",
    "Search engine optimization for social media": "تحسين محركات البحث لوسائل التواصل الاجتماعي",
    "Although the bulk of the SEO we talk about is designed for the web, SEO still plays a role on social media. After all, more and more people these days are using social media as a search engine, especially on TikTok.": "على الرغم من أن الجزء الأكبر من تحسين محركات البحث (SEO) الذي نتحدث عنه مصمم للويب، إلا أن تحسين محركات البحث (SEO) لا يزال يلعب دورًا على وسائل التواصل الاجتماعي. بعد كل شيء، يستخدم المزيد والمزيد من الأشخاص هذه الأيام وسائل التواصل الاجتماعي كمحرك بحث، خاصة على TikTok .",
    "Here are some best practices for using SEO on social media in general:": "فيما يلي بعض أفضل الممارسات لاستخدام تحسين محركات البحث (SEO) على وسائل التواصل الاجتماعي بشكل عام:",
    "Quality over quantity": "الجودة أكثر من الكمية",
    "Have a content strategy": "لديك استراتيجية المحتوى",
    "Make sharing easy": "اجعل المشاركة سهلة",
    "Improve your profile": "تحسين ملف التعريف الخاص بك",
    "Interact with your audience": "فاعل مع جمهورك",
    "Create compelling captions": "إنشاء تسميات توضيحية مقنعة",
    "Is search engine optimization necessary for creatives?": "هل تحسين محركات البحث ضروري للمبدعين؟",
    "Google recently announced an update to its SEO best practices. This Helpful Content Update may be more confusing than helpful to some.": "أعلنت Google مؤخرًا عن تحديث لأفضل ممارسات تحسين محركات البحث (SEO) الخاصة بها. قد يكون “تحديث المحتوى المفيد” هذا مربكًا أكثر من كونه مفيدًا للبعض.",
    "What the update entails is that person-first content (i.e. content designed to please people first and algorithms second) is more important than SEO. Great, so you can't worry about SEO now, right?": "ما يستلزمه التحديث هو أن محتوى الشخص أولاً (أي المحتوى المصمم لإرضاء الأشخاص أولاً والخوارزميات ثانيًا) أكثر أهمية من تحسين محركات البحث. رائع، لذلك لا يمكنك القلق بشأن تحسين محركات البحث (SEO) الآن، أليس كذلك؟",
    "Not so fast. The update also indicates that SEO is still a useful, if not essential, tool. So, what is it?": "ليس بهذه السرعة. يشير التحديث أيضًا إلى أن تحسين محركات البحث (SEO) لا يزال أداة مفيدة، إن لم تكن ضرورية. إذن، ما هو؟",
    "Let's understand what the takeaway is here.": "دعونا نفهم ما هي الوجبات الجاهزة هنا.",
    "Google is right to highlight the importance of person-focused content. You create content for people, not algorithms.": "جوجل على حق في تسليط الضوء على أهمية المحتوى الذي يركز على الشخص. أنت تصنع محتوى للأشخاص، وليس للخوارزميات.",
    "Your content should sound natural, and your voice should shine through. You don't want to look like a robot for the sake of SEO. However, it should still be useful and valuable to people, as they should leave your post or page satisfied.": "يجب أن يبدو المحتوى الخاص بك طبيعيًا، ويجب أن يتألق صوتك. أنت لا تريد أن تبدو كالروبوت من أجل تحسين محركات البحث. ومع ذلك، يجب أن تظل مفيدة وقيمة للأشخاص، حيث يجب عليهم أن يغادروا منشورك أو صفحتك راضين.",
    "If your intention is to rank for SEO purposes only, you'll need to rethink why you're creating content.": "إذا كانت نيتك هي التصنيف لأغراض تحسين محركات البحث فقط، فستحتاج إلى إعادة التفكير في سبب إنشاء المحتوى.",
    "However, you don't want to completely ditch SEO either. It still helps your personal brand grow when applied to person-first content.": "ومع ذلك، فأنت لا تريد التخلص تمامًا من تحسين محركات البحث أيضًا. لا يزال يساعد علامتك التجارية الشخصية على النمو عند تطبيقها على المحتوى الذي يركز على الشخص أولاً .",
    "TL;DR: Create content for people first, implement an SEO strategy second.": "TL;DR: قم بإنشاء محتوى للأشخاص أولاً، ثم قم بتطبيق استراتيجية تحسين محركات البحث (SEO) ثانيًا.",
    "We live in the information age and SEO has become an important part of our daily digital lives. It may be a little daunting at first, but ultimately it's a tool that exists to help your meaningful content cut through the noise and reach the people who matter.": "نحن نعيش في عصر المعلومات وأصبح تحسين محركات البحث (SEO) جزءًا مهمًا من حياتنا الرقمية اليومية. قد يكون الأمر شاقًا بعض الشيء في البداية، ولكنه في النهاية أداة موجودة لمساعدة المحتوى الهادف الخاص بك على تجاوز الضجيج والوصول إلى الأشخاص المهمين.",
    "Blog": "مدونة",
    "Latest Article": "احدث المقالات",
    "Khaled Mahrous": "خالد محروس",
    "Ahmed Salah": "أحمد صلاح",
    "Mahfouz Mohamed": "محفوظ محمد",
    "Beyt-Elkhalegy": "البيت الخليجي للأثاث",
    "El-gud": "الجود للأثاث",
    "Tech-Hub": "Tech-Hub",
    "Rederma": "Rederma"
}
